{
  "Items": [
    {
      "Title": "Инициализация и заполнение массива через цикл",
      "Description": "     <color=green><b>Массив</b></color> — это структура данных, содержащая несколько переменных, доступ к которым осуществляется по вычисляемым индексам. Все содержащиеся в массиве переменные, также называемые элементами массива, относятся к одному типу. Он называется <color=yellow> типом элементов </color>  массива.\n     Сами массивы имеют ссылочный тип, и объявление переменной массива только выделяет память для ссылки на экземпляр массива. Фактические экземпляры массива создаются динамически во время выполнения с помощью оператора new. Операция new указывает <color=orange> длину </color> нового экземпляра массива, которая остается неизменной в течение всего времени существования этого экземпляра. Элементы массива имеют индексы в диапазоне от 0 до Length - 1. Оператор new автоматически инициализирует все элементы массива значением по умолчанию. Например, для всех числовых типов устанавливается нулевое значение, а для всех ссылочных типов — значение null.\n     Следующий пример кода создает массив из int элементов, затем инициализирует этот массив.\n     int[] a = new int[10];\n     for (int i = 0; i < a.Length; i++)\n     {\n         a[i] = i * i;\n     }"
    },
    {
      "Title": "Инициализация массива, нахождение самого маленького числа в массиве, использование foreach",
      "Description": "     Оператор foreach обеспечивает простой и понятный способ итерации по элементам массива или любой перечислимой коллекции.\n     Для одномерных массивов оператор foreach обрабатывает элементы в порядке возрастания индекса, начиная с индекса 0 и заканчивая индексом Length - 1:\n     int[] numbers = { 4, 5, 6, 1, 2, 3, -2, -1, 0 };\n     foreach (int i in numbers)\n     {\n         return i;\n    }\n     Получим: 4 5 6 1 2 3 -2 -1 0"
    },
    {
      "Title": "Поиск элемента в массиве по условию",
      "Description": "     Оператор foreach обеспечивает простой и понятный способ итерации по элементам массива или любой перечислимой коллекции.\n     int[] numbers = { 4, 5, 6, 1, 2, 3, -2, -1, 0 };\n     itemToFind == 0;\n     bool isCoincidence  = false;\n     foreach (int i in numbers)\n     {\n         If(I ==itemToFind)\n         {\n             IsCoincidence = true;\n         }\n     }\n     return IsCoincidence;\n     При проигрывании кода получим IsCoincidence= true; Так как, последняя переменная совпадает с той которую надо найти."
    }
  ]
}